PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/main.c
    buffer_switch = BUF3_PLAY;		 /* record data to buffer1 */
    MIC1TO6_Init();
	                  

#if (USB_STREAMING)	
	/* Initialize USB descriptor basing on channels number and sampling frequency */
	USBD_AUDIO_Init_Microphone_Descriptor(&hUSBDDevice, AUDIO_SAMPLING_FREQUENCY, AUDIO_CHANNELS);
	/* Init Device Library */
	USBD_Init(&hUSBDDevice, &AUDIO_Desc, 0);
	/* Add Supported Class */
	USBD_RegisterClass(&hUSBDDevice, &USBD_AUDIO);
	/* Add Interface callbacks for AUDIO Class */  
	USBD_AUDIO_RegisterInterface(&hUSBDDevice, &USBD_AUDIO_fops);
	/* Start Device Process */
	USBD_Start(&hUSBDDevice);

	/* Init Host Library */
	//test GIT //USBH_Init(&hUSBHost, USBH_UserProcess, 0);

	/* Add Supported Class */
	//test GIT //USBH_RegisterClass(&hUSBHost, USBH_MSC_CLASS);
	
	/* Start Host Process */
	//test GIT //USBH_Start(&hUSBHost); 					  
#endif 

    while (1)
    {
		/* there is data in the buffer */  
		if((WaveRec_idxSens1>=(2*AUDIO_OUT_BUFFER_SIZE-1))&&(stFrstFrmStore<3))
		{
			/* this is just run 1 time after 1st frame of I2S data full */
			if ((stFrstFrmStore<3))
			{
				stFrstFrmStore++;
				buffer_switch = BUF2_PLAY; /* record data to buffer3 */
				if (stFrstFrmStore==2)
				{
				#ifdef CS43L22_PLAY
					/*------------------------PLAYER------------------------------------------*/
					Audio_MAL_Play((uint32_t)Buffer1.bufMIC1,4*AUDIO_OUT_BUFFER_SIZE);
					/*------------------------------------------------------------------------*/
				#endif
					buffer_switch = BUF1_PLAY;
					flgDlyUpd = 0;
				}
			
			}
		
		}

                 /* This calculation happens once time in power cycles */
                 /* After 5 times of full frame recieved interrupt */
                 if (cntStrt==5)
		 {
			   if ((WaveRecord_flgIni<200))
			   {
				  for(char i=0;i<16;i++)
				  {
                                      //if (ValBit(SPI1_stNipple,i)!=0) 
                                      //{
                                      //	 I2S1_stPosShft = 0;//MAX(I2S1_stPosShft,i+1);
                                      // }

                                      //if (ValBit(I2S2_stNipple,i)!=0) 
                                      //{
                                      //   I2S2_stPosShft = 0;//MAX(I2S2_stPosShft,i+1);
                                      //}

                                      if (ValBit(I2S1_stNipple,i)!=0) 
                                      {
                                         SPI4_stPosShft = MAX(SPI4_stPosShft,i+1);
                                      }
				  }
					
			   }
                           else if (WaveRecord_flgIni<255)
                           {
                               WaveRecord_flgIni++;
                           }
			   else
			   {

			   }
					   
		 }
	
		/* USB Host Background task */
		//USBH_Process(&hUSBHost);

		/* AUDIO Menu Process */
		//AUDIO_MenuProcess();
		FFT_Update(); 

		if (flg10ms==1)
		{
		    flg10ms=0;		   		      
	         cntTime200++;
	         if (cntTime200==40)
	         {
	 
#if (DEBUG)

                    //if ((idxLatency14!=0)||(idxLatency25!=0)||(idxLatency36!=0))
                    {
                        int16_t test[5];
                        static uint8_t flagNotMin;
                        test[0] = 0;
                        test[1]= idxLatency63;
                        test[2]= idxLatency14;
                        test[3]= idxLatency25;
						test[4]= idxLatency78;


                        if (EnergySound<2)
                        {
                                //sprintf((char *)pUARTBuf,"No Speech:%d  \r\n",EnergySound);
                                //HAL_UART_Transmit_IT(&huart3,pUARTBuf,30); 
                        }
                        else
                        {
                             sprintf((char *)pUARTBuf,"%d:%d:%d:%d ",idxLatency63,idxLatency14,idxLatency25,idxLatency78);
                             flagNotMin=0 ;

                              if (test[3]>0)
                              {
                                 if((test[1]<=0)&&(test[4]<=0))
                                 {
                                      flagNotMin=1 ;
                                      sprintf((char *)(pUARTBuf+15),"Close Mic 2\r\n");
                                 }
                              }
                              else if (test[3]<-2)
                              {
                                  if((test[1]>1)&&(test[4]>1))
                                  {
                                    flagNotMin=1 ;
                                    sprintf((char *)(pUARTBuf+15),"Clsoe Mic 5\r\n");
                                  }

                              }
                              else
                              {
                              }	
							
			    if (test[2]>2)
                      	    {
                      	       if((test[1]>=-1)&&(test[3]<=-3))
                      	       {
                                 flagNotMin=1 ;
                                 sprintf((char *)(pUARTBuf+15),"Clsoe Mic 4\r\n");
                      	       }
                      	    }
                            else if (test[2]<=-1)
                            {
                               if((test[1]<=-2)&&(test[3]>=0))
                      	       {
                                     flagNotMin=1 ;
                                     sprintf((char *)(pUARTBuf+15),"Clsoe Mic 1\r\n");
                               }
                            }
                            else
                            {

                            }

						   
                            if (test[1]>=0)
                      	    {
                      	       if((test[2]>1)&&(test[4]<= 0))
                      	       {
								 flagNotMin=1 ;
								 sprintf((char *)(pUARTBuf+15),"Clsoe Mic 3\r\n");
                      	       }

                      	    }
                            else if (test[1]<=-3)
                            {
                               if((test[2]<=0)&&(test[4]>=2))
                      	       {
                                   flagNotMin=1 ;
                                   sprintf((char *)(pUARTBuf+15),"Clsoe Mic 6\r\n");
                               }

