PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/main.c
                            }
                            else
                            {

                            }


                            if ((test[4]<=-1))
                            {
                                if ((test[1]>=-1)&&(test[3]>-0))
                                {
                                  sprintf((char *)(pUARTBuf+15),"Clsoe Mic 7\r\n");
                                  flagNotMin=1 ;
                               	}
                            }
                          else if (test[4]>=3)
                          {
                              if ((test[1]<-1)&&(test[3]<-2))
                             {
                                  sprintf((char *)(pUARTBuf+15),"Clsoe Mic 8\r\n");
                                  flagNotMin=1 ;
                             }

                          }
                          else
                          {

                          }


			  if (flagNotMin==0) sprintf((char *)(pUARTBuf+15),"----------- \r\n");
									
                          //HAL_UART_Transmit_IT(&huart3,pUARTBuf,15);
                          SrvB_Debound(&flgS2Ins,&flgS2Flt, flgS2,2);
                          SrvB_Debound(&flgS3Ins,&flgS3Flt, flgS3,2);
                          SrvB_Debound(&flgS4Ins,&flgS4Flt, flgS4,2);

                          stDir = (flgS2Flt<<2)|(flgS3Flt<<1)|(flgS4Flt); 
                           switch (8)
                           {
                               case 0:
                                        sprintf((char *)(pUARTBuf+15),"Direction 0 \r\n");
                                                 
                                    break;
                               case 1:
                                        sprintf((char *)(pUARTBuf+15),"Direction 1 \r\n");
                                        
                                    break;
                               case 2:
                                        sprintf((char *)(pUARTBuf+15),"Direction 2 \r\n");
                                         
                                    break;
                                        
                               case 3:
                                        sprintf((char *)(pUARTBuf+15),"Direction 3 \r\n");
                                 
                                    break;
                               case 4:
                                        sprintf((char *)(pUARTBuf+15),"Direction 4 \r\n");
                                                 
                                    break;
                                case 5:
                                        sprintf((char *)(pUARTBuf+15),"Direction 5 \r\n");
                                         
                                    break;
                                case 6:
                                        sprintf((char *)(pUARTBuf+15),"Direction 6 \r\n");
                                 
                                    break;
                                case 7:
                                        sprintf((char *)(pUARTBuf+15),"Direction 7 \r\n");
                                         
                                    break;
                                 default:
                                    break;
                           }

                           HAL_UART_Transmit_IT(&huart3,pUARTBuf,15+15);		
                         }
                    }

#endif
	   	            cntTime200=0;
        } //(cntTime200==40)
      }//if (flg10ms==1)	
  }
}

/**
  * @brief  Toggle Leds.
  * @param  None
  * @retval None
  */
void Toggle_Leds(void)
{
  static uint32_t ticks = 0;

  if (ticks++ > 200)
  {
    //BSP_LED_Toggle(LED1);
    ticks = 0;
  }
}


/**
  * @brief  User Process
  * @param  phost: Host Handle
  * @param  id: Host Library user message ID
  * @retval None
  */
static void USBH_UserProcess(USBH_HandleTypeDef *phost, uint8_t id)
{
  switch(id)
  { 
  case HOST_USER_SELECT_CONFIGURATION:
    break;
    
  case HOST_USER_DISCONNECTION:
    appli_state = APPLICATION_DISCONNECT;
    break;

  case HOST_USER_CLASS_ACTIVE:
    appli_state = APPLICATION_READY;
    break;
 
  case HOST_USER_CONNECTION:
    appli_state = APPLICATION_START;
    break;
   
  default:
    break; 
  }
}

/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 216000000
  *            HCLK(Hz)                       = 216000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 4
  *            APB2 Prescaler                 = 2
  *            HSE Frequency(Hz)              = 25000000
  *            PLL_M                          = 25
  *            PLL_N                          = 432
  *            PLL_P                          = 2
  *            PLL_Q                          = 9
  *            VDD(V)                         = 3.3
  *            Main regulator output voltage  = Scale1 mode
  *            Flash Latency(WS)              = 7
  * @param  None
  * @retval None
  */
static void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;
  HAL_StatusTypeDef ret = HAL_OK;

  /* Enable HSE Oscillator and activate PLL with HSE as source */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 25;
  RCC_OscInitStruct.PLL.PLLN = 432;  
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 9;

  ret = HAL_RCC_OscConfig(&RCC_OscInitStruct);
  if(ret != HAL_OK)
  {
    //while(1) { ; }
  }

  /* Activate the OverDrive to reach the 216 MHz Frequency */
  ret = HAL_PWREx_EnableOverDrive();
  if(ret != HAL_OK)
  {
    //while(1) { ; }
  }

  /* Select PLLSAI output as USB clock source */
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_CLK48 ;
  PeriphClkInitStruct.Clk48ClockSelection = RCC_CLK48SOURCE_PLLSAIP;

  
